Tekla.Structures.Dialog.UIControls.ReinforcementCatalog
The ReinforcementCatalog class represents a group of controls to select rebars
using the rebar catalogs.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.#ctor(System.String,System.String,System.Double)
Creates a new instance of the ReinforcementCatalog and will select in the tree
the rebar that contains the given parameters (if possible).
Size: The size of the rebar to be selected.
Grade: The grade of the rebar to be selected.
BendRadius: The bend radius of the rebar to be selected.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog._RebarSelectionForm
New instance of the reinforcement selection dialog

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.OnLoad(System.EventArgs)
When the load event is raised, the control begins to enumerate through the rebar
catalog.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.OnSelectClicked(System.Object,System.EventArgs)
Opens the profile catalog dialog for selecting a profile
Sender:
EventArgs:

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.SelectedRebarSize
Gets the selected rebar size in the control.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.SelectedRebarGrade
Gets the selected rebar grade in the control.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.SelectedRebarBendingRadius
Gets the selected rebar bending radius in the control.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.RebarList
Gets all the catalog rebar items.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.RebarSelectionForm
New instance of the reinforcement selection dialog

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ReinforcementCatalog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.